app/Controllers/Admin/Users.php

    public function index()
    {
        $data = [
            'title' => 'User list',
            'path_pages' => ['Home','User','User list'],
            'users' => $this->userModel->findAll()
        ];
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function loadUsers() {

        $data = ['data' => $this->userModel->findAll() ];
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function updateUser() {
        if (!$this->request->isAJAX()) {
            exit('Error! Access denied!') ;
        }

        $post = $this->request->getPost();


        if (empty($post['rowdata']['password'])) {
            unset($post['rowdata']['password']);
        }

        $userArr =  $post['rowdata'];

        if (empty($post['rowdata']['password'] ) ) {
            unset($post['rowdata']['password']);
        }

        if ($this->userModel->protect(false)->save($userArr)) {
---
UPDATE `users` SET `id` = '1', `firstname` = 'Prisco', `lastname` = 'Cleyton Pinheiro', `email` = 'priscocleyton@gmail.com', `mobile` = '86994547958', `username` = 'coldxlock', `updated_at` = '2023-03-06 15:04:05'
WHERE `users`.`id` IN ('1')

    public function deleteUser() {
        try {
            if (!$this->request->isAJAX()) {
                exit('Error! Access denied!') ;
            }
            $post = $this->request->getPost();
            if (!empty($post)) {
                // $user = $this->findUser($post['rowdata']['id']);
                $id = $post['rowdata']['id'];
                if ($this->userModel->delete($id)) {
---
UPDATE `users` SET `deleted_at` = '2023-03-06 15:07:37', `updated_at` = '2023-03-06 15:07:37'
WHERE `id` IN ('4')
AND `deleted_at` IS NULL