app/Controllers/Admin/Users.php

    public function loadUsers() {

        $data = [
            'data' => $this->userModel->findAll()
        ];
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL